#+title:  i3 literate configuration file
#+author: emil lenz
#+email:  emillenz@protonmail.com
#+date:   2023-05-15
#+info: creation: 2023-05-15, using marks & literate style: 2024-11-15
#+property: header-args:conf :tangle config

* workspaces
- the idea is to bind to the abstract function of the program, and not to the specific instance itself => if a different program is used, the functionality and bindings remain the same.  (eg: vim instead of emacs).
- if you are forced to work with a desktop environment, you can easily replicate this config by manually putting clients on separate workspaces and using [[kbd:][MOD+<number>]] to switch.
- workspace assigned programs are started automatically by the ~autostart~ script and a binding to open them client-server style when it makes sense (if accidentally closed), all other apps are to be opened via rofi desktop laucher.  ensuring these programs are always running just reduces mental overhead and startup time.
- the parenthesis around the commands are required, otherwise undefined behaviour.
- get window title & class information using: ~xprop~
- for windows that are not assigned to workspaces it is most efficient to use the rofi find-window menu.
- workspaces are powerful, since they allow multiple windows of the same class to be opened on the same workspace (eg. multiple instances of zathura).  and they allow per window gaps/fullscreen configuration.

#+name: workspaces
#+begin_src elisp
(let ((workspaces '(;; ("name" "wmclass" "startcmd" "use-gaps?")

                    ;; windows not assigned to their own workspaces
                    ("all"
                     ".")

                    ("term"
                     "Alacritty"
                     "alacritty --title term --command tmux new-session -A -s main"
                     t)

                    ("edit"
                     "Emacs"
                     "emacsclient --reuse-frame || (emacs --daemon && emacsclient --create-frame)"
                     t)

                    ("read"
                     "Zathura"
                     nil)

                    ("web"
                     "firefox"
                     "firefox"))))

  (mapconcat (lambda (tuple)
               (let* ((name (nth 0 tuple))
                      (key (char-to-string (aref name 0)))
                      (class (nth 1 tuple))
                      (cmd (nth 2 tuple))
                      (gaps-flag (nth 3 tuple)))

                 (mapconcat #'identity
                            (remove nil (list (format "# WORKSPACE: %s" (upcase name))

                                              (when gaps-flag
                                                (format "workspace %s gaps horizontal $GAPSIZE"
                                                        name))

                                              (format "for_window [class=\"%s\"] move container to workspace %s"
                                                      class
                                                      name)

                                              (format "bindsym $MOD+%s workspace %s"
                                                      key
                                                      name)

                                              (when cmd (format "bindsym $MOD+shift+%s exec --no-startup-id %s" key cmd))))
                            "\n")))
             workspaces
             "\n\n"))
#+end_src

#+RESULTS[3ce1064a1beacc21856743d63ee482ba4fafae3a]: workspaces
#+begin_example
# WORKSPACE: ALL
for_window [class="."] move container to workspace all
bindsym $MOD+a workspace all

# WORKSPACE: TERM
workspace term gaps horizontal $GAPSIZE
for_window [class="Alacritty"] move container to workspace term
bindsym $MOD+t workspace term
bindsym $MOD+shift+t exec --no-startup-id alacritty --title term --command tmux new-session -A -s main

# WORKSPACE: EDIT
workspace edit gaps horizontal $GAPSIZE
for_window [class="Emacs"] move container to workspace edit
bindsym $MOD+e workspace edit
bindsym $MOD+shift+e exec --no-startup-id emacsclient --reuse-frame || (emacs --daemon && emacsclient --create-frame)

# WORKSPACE: READ
for_window [class="Zathura"] move container to workspace read
bindsym $MOD+r workspace read

# WORKSPACE: WEB
for_window [class="firefox"] move container to workspace web
bindsym $MOD+w workspace web
bindsym $MOD+shift+w exec --no-startup-id firefox
#+end_example

(read: ~M-x info-display-manual org~ chapter: =16 working with source code=, if you don't know what this magic is doing)
#+begin_src conf
<<workspaces()>>

# HACK :: must come last to apply to all workspaces.
for_window [all] focus, title_window_icon no, floating disable
#+end_src

